#!/usr/bin/python
################################################
from config import bot
from plugins.callback import callback_inline
from plugins.kick import kick
from plugins.mute import mute, unmute
from plugins.pin import pin, unpin
from plugins.base import encode, decode
from plugins.start import start, helps
from plugins.service import handler_new_member, left_chat_member
from plugins.say import say
from plugins.voice import voice
from plugins.banner import banner, on, off
from plugins.chat import description, link, invite, delete, post, id_chat
from plugins.wiki import wikipedia
from plugins.screenshot import screen
from plugins.cats import cats
from plugins.github import github
from plugins.command_id import command_id
from plugins.translation import en, ru
from plugins.game import game
from plugins.search import search, search_youtube
from plugins.proxy import proxy
from plugins.top import top, deletedb, createdb, writes, write
from plugins.news import news
from telebot import types
from plugins.error import Error
from telebot.apihelper import ApiTelegramException

bot.remove_webhook() # отключает вебхук

banner() #выводим баннер

try:

    @bot.message_handler(commands=['news'])
    def new(m):
        news(m)
    #________________________________________________________________________________________________________________
    #Команда Удаления таблицы
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['deletedb'])
    def delete_database(m):
        deletedb(m)
    #________________________________________________________________________________________________________________
    #Команда создания таблицы
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['createdb'])
    def create_database(m):
        createdb(m)
    #________________________________________________________________________________________________________________
    #Вывести топ пользователей чата
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['top'])
    def top_users(m):
        top(m)
    #________________________________________________________________________________________________________________
    #Выдаем свежий список прокси
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['proxy'])
    def proxys(m):
        proxy(m)
    #________________________________________________________________________________________________________________
    #Команда поиска в ютубе
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['sy'])
    def searchs_youtube(m):
        search_youtube(m)
    #________________________________________________________________________________________________________________
    #Поиск информации в гугл
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['search'])
    def searchs(m):
        search(m)
    #________________________________________________________________________________________________________________
    #Получить айди чата
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['chat_id'])
    def id_chats(m):
        id_chat(m)
    #________________________________________________________________________________________________________________
    #Игра камень ножницы бумага
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['game'])
    def games(m):
        game(m)
    #________________________________________________________________________________________________________________
    #Удаляем сообщение о закрепленной хуйни(хезе как назвать)
    #________________________________________________________________________________________________________________
    @bot.message_handler(content_types=['pinned_message'])
    def pindel(m):
        bot.delete_message(m.chat.id, m.message_id)
    #________________________________________________________________________________________________________________
    #Кодируем в base64
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['encode'])
    def encodes(m):
        encode(m)
    #________________________________________________________________________________________________________________
    #Декодируем base64
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['decode'])
    def decodes(m):
        decode(m)
    #________________________________________________________________________________________________________________
    #Команда /mute
    #________________________________________________________________________________________________________________
    
    @bot.message_handler(commands = ["mute"])
    def test(m):
        mute(m)

    @bot.message_handler(commands=["unmute"])
    def test(m):
        unmute(m)
    

    #________________________________________________________________________________________________________________
    #Команда /pin закрепить сообщение
    #________________________________________________________________________________________________________________

    @bot.message_handler(commands=["pin"])#, '!unpin'))
    def pins(m):
        pin(m)

    @bot.message_handler(commands = ["unpin"])
    def unpins_(m):
        unpin(m)
    
    #________________________________________________________________________________________________________________
    #Команда /say голос толпы
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['say']) #Команда /say [text]
    def says(m):
        say(m)
    #________________________________________________________________________________________________________________
    #переводим голосовое в текст
    #________________________________________________________________________________________________________________
    @bot.message_handler(content_types=['voice']) #Принимаем голосовое сообщение
    def voices(message):
        voice(message)
    #________________________________________________________________________________________________________________
    #Провожаем вышедшего пользователя
    #________________________________________________________________________________________________________________
    @bot.message_handler(content_types=['left_chat_member']) #Отвечает, когда кто то выходит из чата
    def left_chat_members(m):
        left_chat_member(m)
    #________________________________________________________________________________________________________________
    #Встречаем нового пользователя в чате
    #________________________________________________________________________________________________________________
    @bot.message_handler(content_types=["new_chat_members"]) #Приветствие новому участнику чата
    def handler_new_members(m):
        handler_new_member(m)
    #________________________________________________________________________________________________________________
    #Команда /kick отправляем пользователя на нары :D
    #________________________________________________________________________________________________________________
    
    @bot.message_handler(commands=["kick"]) #Команда /kick
    def kickid(m):
        kick(m)
    
    #________________________________________________________________________________________________________________
    #Команда /start выводим меню вкусняшек
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['start'])
    def any_start(m):
        start(m)
    #________________________________________________________________________________________________________________
    #Команда /help выводим меню вкусняшек
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['help'])
    def any_help(m):
        helps(m)
    #________________________________________________________________________________________________________________
    #Вывод кнопочек :D
    #________________________________________________________________________________________________________________
    @bot.callback_query_handler(func=lambda call: True)
    def callback_inlines(call):
        callback_inline(call)
    #________________________________________________________________________________________________________________
    #перевод на русский
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['ru'])
    def russian(m):
        ru(m)
    #________________________________________________________________________________________________________________
    #перевод на английский
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['en'])
    def english(m):
        en(m)
    #________________________________________________________________________________________________________________
    #Команда /id Показатель id пользователя
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['id']) #команда /id
    def commands_id(m):
        command_id(m)
    
    @bot.message_handler(commands=["logs"])
    def logs(m): ##№
        if bot.get_chat_member(m.chat.id, m.from_user.id).status in ["administrator", "creator"]:
            bot.delete_message(m.chat.id, m.message_id)
            keyboard = types.InlineKeyboardMarkup()
            keyboard_delete = types.InlineKeyboardButton(text = "❌", callback_data = "delete")
            keyboard.add(keyboard_delete)
            FILE = open("/app/plugins/log-error.txt", "rb")
            bot.send_document(m.chat.id, FILE, reply_markup = keyboard, parse_mode = "Markdown")
            FILE.close()
        else:
            Error(m,bot).error_permission()

    #________________________________________________________________________________________________________________
    #Присылает стикер на слово "Винда"
    #________________________________________________________________________________________________________________
    @bot.message_handler(regexp=r'^[^./].*(инд)[ауя]')
    def windows(m):
        bot.send_sticker(m.chat.id, "CAACAgQAAxkBAALoU17aTycp4L0kAkIssMm9au-ZFzIAAxQAA7p6vBnUv7ww6GyZrhoE")
    #________________________________________________________________________________________________________________
    #Запостить текст на канал
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['post'])
    def posts(m):
        post(m)
    #________________________________________________________________________________________________________________
    #Удалить пересланное сообщение, не знаю зачем, но мне в кайф
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['del'])
    def deletes(m):
        delete(m)
    #________________________________________________________________________________________________________________
    #Команда /github моя ветка на гитхабе
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['github']) #Команда /github
    def git(m):
        github(m)
    #________________________________________________________________________________________________________________
    #Команда /invite отправляем пользователя за ссылкой приглашения в чат
    #________________________________________________________________________________________________________________

    @bot.message_handler(commands=['invite']) #Команда /invite
    def invites(m):
        invite(m)
    
    #________________________________________________________________________________________________________________
    #Отправляем рандомных котеек
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['cats']) #Команда /cats
    def cat(m):
        cats(m)
    #________________________________________________________________________________________________________________
    #Скриншот сайтов
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['url'])
    def url(m):
        screen(m)
    #________________________________________________________________________________________________________________
    #Получаем ссылку на приглашение в чат
    #________________________________________________________________________________________________________________
    
    @bot.message_handler(commands=['link'])
    def links(m):
        link(m)
    

    #________________________________________________________________________________________________________________
    #команда википедии
    #________________________________________________________________________________________________________________
    @bot.message_handler(commands=['wiki'])
    def wiki(m):
        wikipedia(m)
    #________________________________________________________________________________________________________________
    #Меняем описание чата
    #________________________________________________________________________________________________________________
    
    @bot.message_handler(commands= ['des'])
    def chat(m):
        description(m)

    #________________________________________________________________________________________________________________

    #________________________________________________________________________________________________________________
    #Записываем все сообщения пользователей в чате
    #________________________________________________________________________________________________________________
    @bot.message_handler(func=lambda message: True, content_types=["text", "sticker", "photo", "audio", "video", "document"])
    def writes_users(message):
        if message.from_user.username == "alexashkin":
            bot.send_message(m.chat.id, "Ярик не дури, это чужой бот. АЦТАНЬ")
            print ("@alexashkin долбит бота")
        else:
            write(message)
    on()
    try:
        bot.infinity_polling(none_stop=True)
    except:
        pass
    off()
except (ApiTelegramException, Exception, FileNotFoundError, RecursionError) as e:
    print ("❌_____________________________________❌")
    print ("❌❌❌ОШИБКА❌❌❌")
    print (e)
    print ("❌_____________________________________❌")

