permission = ['У вас нет прав на использование этой команды', 'Недостаточно прав', 'Ну куда ты лезишь, команда не для тебя',
'Не делай так больше', 'Вот ты псих :D', "А ну брысь отсюда", "Ну и что ты хочешь от меня?", "Ты действительно думаешь что я выполню твою просьбу?",
"Кышь, твои полномочия всё", "Нет, я этого не сделаю", "Все надоели, я в отпуске"]

reply = ['Перешлите сообщение', 'По-моему где-то сообщение потерялось и до меня не дошло', 'А сообщение где?',
'Я бы пошутил про UDP, но боюсь, что не дайдет, как и ваше пересланное сообщение', "А пересылать сообщение кто будет?"]

admin = ['Я не имею прав трогать админов', 'Мои чары на администрацию не распространяется', 'А может не будем трогать админов?',
'Не надо раздражать админов', 'Ну это пиздец, зачем мы админов тронули, ну все, пойду вешаться', "На что ты меня подписываешь? Не трошь админов",
"Не надо расстраивать администрацию"]

errors = ['Ошибка', 'Ой, я ошибку поймал', "Я поймал KERNEL PANIC", "Что-то мне сегодня не хорошо",
"Произошла ошибка, но я все равно буду работать"]

private = ['Команда не работает в лс бота', 'Команда работает только в чате', 'Ну и зачем ты это делаешь? Эта команда не для лс']

shout = ['Крик из толпы', 'Я слышал, как кто-то крикнул', "Хакеры пришли и написали"]